# Chapter 6

## 6.1 Reading and Writing Data in Text Format

In [124]:
import pandas as pd
import sys
import numpy as np
import csv
import json
from lxml import objectify

In [125]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [126]:
df = pd.read_csv('examples/ex1.csv')

In [127]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [128]:
pd.read_table('examples/ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [129]:

!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [130]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [131]:
pd.read_csv('examples/ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [132]:

names=['a','b','c','d','message']

In [133]:
pd.read_csv('examples/ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [134]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [135]:
parsed=pd.read_csv('examples/csv_mindex.csv', index_col=['key1','key2'])

In [136]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [137]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [138]:
!cat 'examples/ex3.txt'

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [139]:
result=pd.read_table('examples/ex3.txt',sep = '\s+')

In [140]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [141]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [142]:
pd.read_csv('examples/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [143]:
!cat 'examples/ex5.csv'

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [144]:
result=pd.read_csv('examples/ex5.csv')

In [145]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [146]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [147]:
result=pd.read_csv('examples/ex5.csv',na_values=['NULL'])

In [148]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [149]:
sentinels={'message':['foo','NA'],'something':['two']}

In [150]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### Reading text files in pieces

In [151]:
pd.options.display.max_rows = 10

In [152]:
result = pd.read_csv('examples/ex6.csv')

In [153]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [154]:
pd.read_csv('examples/ex6.csv',nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [155]:
chunker=pd.read_csv('examples/ex6.csv',chunksize=1000)

In [156]:
chunker

In [157]:
tot = pd.Series([])

<ipython-input-157-0dfcb0830956>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [158]:
for piece in chunker:
    tot=tot.add(piece['key'].value_counts(),fill_value=0)

In [159]:
tot = tot.sort_values(ascending=False)

In [160]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### Writing data to text format

In [161]:
data = pd.read_csv('examples/ex5.csv')

In [162]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [163]:
data.to_csv('examples/out.csv')

In [164]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [165]:
import sys

In [166]:
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [167]:
data.to_csv(sys.stdout,na_rep = 'NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [168]:
data.to_csv(sys.stdout,index=False,header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [169]:
data.to_csv(sys.stdout,index=False, columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [170]:
dates=pd.date_range('1/1/2000',periods=7)

In [171]:
ts=pd.Series(np.arange(7), index=dates)

In [172]:
ts.to_csv('examples/tseries.csv')

In [173]:
!cat examples/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

### Working with delimited formats

In [174]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [175]:
f=open('examples/ex7.csv')

In [176]:
reader=csv.reader(f)

In [177]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [178]:
with open('examples/ex7.csv') as f:
    lines=list(csv.reader(f))

In [179]:
header,values=lines[0],lines[1:]

In [180]:
data_dict={h:v for h,v in zip(header,zip(*values))}

In [181]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [183]:
class my_dialect(csv.Dialect):
    lineterminator='\n'
    delimiter=';'
    quotechar='"'
    quoting=csv.QUOTE_MINIMAL

reader = csv.reader(f, dialect=my_dialect)

ValueError: I/O operation on closed file.

In [184]:
reader

In [185]:
reader=csv.reader(f,delimiter='|')

ValueError: I/O operation on closed file.

In [186]:
reader

In [187]:
with open('mydata.csv','w') as f:
    writer = csv.writer(f,dialect=my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

## JSON (Java Script Object Notation) Data

In [189]:
obj="""
{"name":"Wes",
 "places_lived":["United States","Spain","Germany"],
 "pet":null,
 "siblings":[{"name":"Scott","age":30,"pets":["Zeus","Zuko"]},
             {"name":"Katie","age":38,"pets":["Sixes","Stache","Cisco"]}]
}
"""

In [190]:
result=json.loads(obj)

In [191]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [192]:
asjson = json.dumps(result)

In [193]:
siblings = pd.DataFrame(result['siblings'], columns=['name','age'])

In [194]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [195]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [196]:
data = pd.read_json('examples/example.json')

In [197]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [198]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [199]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### XML and HTML: Web Scraping

Python has many libraries for reading and writing data in the ubiquitous HTML and XML formats. Examples include lxml, Beautiful Soup, and html5lib. While lxml is comparatively much faster in general, the other libraries can better handle malformed HTML or XML files.

In [200]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [201]:
len(tables)

1

In [202]:
failures=tables[0]

In [203]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [204]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [205]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2001      4
2004      4
2003      3
2007      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

### Parsing XML with lxml.objectify
XML (eXtensible Markup Language) is another common structured data format supporting hierarchical, nested  data with metadata.

In [206]:
path = 'examples/mta_perf/Performance_MNR.xml'

In [207]:
parsed=objectify.parse(open(path))

In [208]:
root = parsed.getroot()

In [211]:
root

In [212]:
data=[]
skip_fields = ['PARENT_SEQ','INDICATOR_SEQ', 'DESIRED_CHANGE','DECIMAL_PLACES']

In [213]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag]=child.pyval
    data.append(el_data)

In [214]:
perf=pd.DataFrame(data)

In [215]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [216]:
from io import StringIO
tag = '<a href = "http://www.google.com">Google</a>'

In [217]:
root = objectify.parse(StringIO(tag)).getroot()

In [218]:
root

In [219]:
root.get('href')

'http://www.google.com'

In [220]:
root.text

'Google'

## 6.2 Binary Data Formats

In [222]:
frame = pd.read_csv('examples/ex1.csv')

In [223]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [224]:
frame.to_pickle('examples/frame_pickle')

In [225]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### Using HDF5 Format

In [226]:
frame = pd.DataFrame({'a':np.random.rand(100)})

In [227]:
store = pd.HDFStore('mydata.h5')

In [228]:
store['obj1']=frame

In [229]:
store['obj1_col']=frame['a']

In [230]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [231]:
store['obj1']

           a
0   0.144876
1   0.372135
2   0.765880
3   0.991751
4   0.273436
..       ...
95  0.458152
96  0.347214
97  0.774313
98  0.382112
99  0.965295

[100 rows x 1 columns]

In [232]:
 store.put('obj2',frame, format='table')

In [233]:
store.select('obj2',where=['index>=10 and index<=15'])

           a
10  0.002475
11  0.540274
12  0.655443
13  0.343853
14  0.993215
15  0.691964

In [234]:
store.close()

In [235]:
frame.to_hdf('mydata.h5','obj3',format='table')

In [236]:
pd.read_hdf('mydata.h5','obj3',where=['index<5'])

          a
0  0.144876
1  0.372135
2  0.765880
3  0.991751
4  0.273436

### Reading Microsoft Excel Files

In [237]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [238]:
pd.read_excel(xlsx,'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [239]:
frame = pd.read_excel('examples/ex1.xlsx','Sheet1')

In [240]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [241]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [242]:
frame.to_excel(writer,'Sheet1')

In [243]:
writer.save()

In [244]:
frame.to_excel('examples/ex2.xlsx')

## 6.3 Interacting with Web APIs

In [245]:
import requests

In [246]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [247]:
resp=requests.get(url)

In [248]:
resp

In [249]:
data=resp.json()

In [250]:
data[0]['title']

'TST: Use hypothesis for test_round_sanity'

In [251]:
issues=pd.DataFrame(data,columns=['number','title','labels','state'])

In [252]:
issues

,number,title,labels,state
0,44550,TST: Use hypothesis for test_round_sanity,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
1,44549,REF: use base class for BooleanArray any/all,"[{'id': 127681, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
2,44548,REF: deduplicate nullable arrays _cmp_method,"[{'id': 127681, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
3,44547,TYP: masked array mask,"[{'id': 47223669, 'node_id': 'MDU6TGFiZWw0NzIy...",open
4,44546,Backport PR #44518 on branch 1.3.x (BUG: DataF...,[],open
...,...,...,...,...
25,44488,Fix 'rtol' and 'atol' for numeric extension types,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
26,44485,BUG: dataframe.replace({np.nan: None}) failed ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,44484,API (BUG?): DatetimeArray.astype vs to_numpy b...,"[{'id': 211840, 'node_id': 'MDU6TGFiZWwyMTE4ND...",open
28,44483,BUG: fix get_indexer_non_unique() with 'object...,[],open
29,44482,BUG: get_indexer_non_unique() does not handle ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

## 6.4 Interacting with Databases

In [253]:
import sqlite3

In [255]:
query="""
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER
);"""

In [256]:
con=sqlite3.connect("mydata.sqlite")

In [257]:
con.execute(query)

In [258]:
con.commit()

In [259]:
data = [('Atlanta','Georgia',1.25,6),('Tallahassee','Florida',2.6,3),('Sacramento','California',1.7,5)]

In [260]:
stmt="INSERT INTO test VALUES (?,?,?,?)"

In [261]:
con.executemany(stmt,data)

In [262]:
con.commit()

In [263]:
cursor=con.execute('select * from test')

In [264]:
rows=cursor.fetchall()

In [265]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [266]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [267]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [268]:
import sqlalchemy as sqla

In [269]:
db=sqla.create_engine('sqlite:///mydata.sqlite')

In [270]:
pd.read_sql('select * from test',db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5